// ⦁	Зоомагазин
// Напишете програма, която пресмята нужните разходи за закупуването на храна за кучета и котки.  Храната се пазарува от зоомагазин, като една опаковка храна за кучета е на цена 2.50 лв, а опаковка храна за котки струва 4 лв.
// Вход
// От конзолата се четат 2 реда:
// ⦁	Броят на опаковките храна за кучета – цяло число в интервала [0… 100]
// ⦁	Броят на опаковките храна за котки –  цяло число в интервала [0… 100]
// Изход
// На конзолата се отпечатва: 
// "{крайната сума} lv."

function PetShop(input)
{
    let dogFood = input.shift();
    let catFood = input.shift()
    let dogFoodPrice = 2.50;
    let catFoodprice = 4;
    let allFoodPrice = (dogFood * dogFoodPrice) + (catFood * catFoodprice);
    console.log(`${allFoodPrice} lv.`)
}
PetShop(["13",
"9"]
)