// ⦁	Световен рекорд по плуване
// Иван решава да подобри Световния рекорд по плуване на дълги разстояния. Функцията получава: рекордът в секунди,  който Иван трябва да подобри,  разстоянието в метри, което трябва да преплува и времето в секунди, за което плува разстояние от 1 м. Да се напише функция, която изчислява дали се е справил със задачата, като се има предвид, че: съпротивлението на водата го забавя на всеки 15 м. с 12.5 секунди. Когато се изчислява колко пъти Иванчо ще се забави, в резултат на съпротивлението на водата, резултатът трябва да се закръгли надолу до най-близкото цяло число.
// Да се изчисли времето в секунди, за което Иванчо ще преплува разстоянието и разликата спрямо Световния рекорд. 
// Вход
// Функцията получава 3 аргумента:
// ⦁	Рекордът в секунди – реално число в интервала [0.00 … 100000.00]
// ⦁	Разстоянието в метри – реално число в интервала [0.00 … 100000.00]
// ⦁	Времето в секунди, за което плува разстояние от 1 м. - реално число в интервала [0.00 … 1000.00]
// Изход
// Отпечатването на конзолата зависи от резултата:
// ⦁	Ако Иван е подобрил Световния рекорд (времето му е по-малко от рекорда) отпечатваме:
// ⦁	" Yes, he succeeded! The new world record is {времето на Иван} seconds."
// ⦁	Ако НЕ е подобрил рекорда (времето му е по-голямо или равно на рекорда) отпечатваме:
// ⦁	"No, he failed! He was {недостигащите секунди} seconds slower."
// Резултатът трябва да се форматира до втория знак след десетичната запетая.

function swimmingRecord(input)
{
    let timeToBeat = input.shift();
    let distanceM = input.shift();
    let timePerOneM = input.shift();
    let hisTime = distanceM * timePerOneM;
    let slowDown = Math.floor((distanceM / 15)) * 12.5;
    let totalTime = hisTime + slowDown;
    let difference = totalTime - timeToBeat;

if (totalTime>=timeToBeat){
    console.log(`No, he failed! He was ${difference.toFixed(5)} seconds slower.`);


}
else{
    console.log(`Yes, he succeeded! The new world record is ${totalTime.toFixed(5)} seconds.`)
}

}
swimmingRecord((["55555.67",
"3017",
"5.03"]))